{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"landmark_sequence": {"name": "landmark_sequence:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "1872"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1872"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/global_pool_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "landmark_sequence", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}, {"size": "1872"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["landmark_sequence", "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims", "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims_1", "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/Relu", "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/mul_1", "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/add_1", "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims", "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims_1", "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/Relu", "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/mul_1", "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/global_pool_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/add_1", "StatefulPartitionedCall/LandmarkEmotionModel_1/global_pool_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/global_pool_1/Mean", "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/Relu", "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/convolution/ExpandDims_1", "shape": [1, 3, 1872, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv1_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn1_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/convolution/ExpandDims_1", "shape": [1, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/conv2_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/bn2_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/global_pool_1/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/Cast/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/dense1_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/Cast/ReadVariableOp", "shape": [128, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/LandmarkEmotionModel_1/output_1/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}]}]}